# ==========================================
# โจทย์ข้อที่ 4: สัญญาณไฟจราจร
# Input: สีของสัญญาณไฟ ("red", "yellow", "green")
# Output: พิมพ์ "Stop" ถ้าเป็น red | "Slow" ถ้าเป็น yellow | "Go" ถ้าเป็น green | "Invalid" กรณีอื่นๆ
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
red = input("สีแดง")
yellow = input("สีเหลือง")
green = input("สีเขียว")
if("Stop: ")
    print("สีแดง")
elif("Slow: ")
    print("สีเหลือง")
elif("Go: ")
    print("สีเขียว")
 else("Invalid": )
    print("กรณีอื่นๆ")
